system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.15  0.00  0.0)   // 0 (chão frontal esquerdo)
    ( 0.15  0.00  0.0)   // 1 (chão frontal direito)
    ( 0.15  0.30  0.0)   // 2 (chão traseiro direito)
    (-0.15  0.30  0.0)   // 3 (chão traseiro esquerdo)
    (-0.15  0.00  1.0)   // 4 (teto frontal esquerdo)
    ( 0.15  0.00  1.0)   // 5 (teto frontal direito)
    ( 0.15  0.30  1.0)   // 6 (teto traseiro direito)
    (-0.15  0.30  1.0)   // 7 (teto traseiro esquerdo)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 5 4)  // Frente aberta (entrada de ar)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 3 7 6)  // Traseira aberta (saída de ar)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)  // Chão fixo
        );
    }

    openSides
    {
        type pressureInletOutletVelocity;  // Faces laterais abertas
        faces
        (
            (1 2 6 5)  // Lateral direita
            (3 0 4 7)  // Lateral esquerda
            (4 5 6 7)  // Topo aberto
        );
    }
);


// ************************************************************************* //