constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v12                                   |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

nu              1.5e-05;  /* Viscosidade cinemática do ar (m²/s)*/
rho             1.12;    /* Densidade do ar (kg/m³)*/

/*************************************************************************/
