0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    inlet 
    {
        type            totalPressure;
        p0              uniform 14;    // Juiz de Fora, 26ºC, Altidude 600
        value           uniform 0;
    }

    outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }

    ground 
    {
        type            zeroGradient;
        value           uniform 0;
    }

    openSides
    {
        type            zeroGradient;
        value           uniform 0;
    }
}

// ************************************************************************* //
