0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                   
|
|
|      3/2 * ( % * u_8 )^2
|      Medir velocidade na ponta do ventilador e calcular o valor para 
|      colocar aqui
|                              
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01875;

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }

   inlet
    {
        type            fixedValue;
        value           uniform 0.01875;  // Entrada com k baseado na intensidade do vento
    }

    outlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            fixedValue;
        value           uniform 0.0;  // Nenhuma turbulência na superfície fixa
    }

    openSides
    {
        type            zeroGradient;  // Laterais e topo livres para variação natural
    }

    helice3
    {
        type            kqRWallFunction;
        value           $internalField;
    }


}

// ************************************************************************* //