0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.573;

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    4*0.333756/0.00879*0.07;
        value           $internalField;
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground 
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    
   
    openSides
    {
        type            zeroGradient;
    }
    
}

// ************************************************************************* //
