system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

// Definição da geometria STL
surfaces
(
    "helice3.stl"
    "AMI_c.stl"
);

// Configuração das features
features
(
    {
        file "helice3.eMesh";
        level 4;
    }

    {
        file "AMI_c.eMesh";
        level 4;
    }
);

extractionMethod extractFromSurface;

extractFromSurfaceCoeffs
{
    includedAngle 150;
}

writeObj yes;


// ************************************************************************* //
